// Завдання 2: Конкатенація радків та шаблонний рядок

// Створіть дві змінні, які містять імена двох осіб. Використовуючи 
// конкатенацію рядків, створіть новий рядок, який містить 
// вітання для обох осіб. Виведіть результат в консоль. 
// Потім використайте шаблонний рядок для створення того ж вітання. 
// Виведіть результат в консоль.

let name1 = "Макс";
let name2 = "Юра";

let text1 = "Радий тебе бачити, " + name1 + " і тебе, мій друже " + name2;
let text2 = `Радий тебе бачити ${name1} і тебе, мій друже ${name2}`;

console.log(text1);
console.log(text2);